
## Plan Result (aat)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_servicebus_subscription_rule.civil_ccd_jurisdiction_rule
  * module.servicebus-subscription-ccd-events.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_servicebus_subscription_rule.civil_ccd_jurisdiction_rule will be created
  + resource "azurerm_servicebus_subscription_rule" "civil_ccd_jurisdiction_rule" {
      + filter_type                    = "SqlFilter"
      + id                             = (known after apply)
      + name                           = "civil-ccd-event-rule-aat"
      + sql_filter                     = "jurisdiction_id IN ('CIVIL','civil')"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)
    }

  # module.servicebus-subscription-ccd-events.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + batched_operations_enabled                = false
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "civil-ccd-case-events-sub-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-aat/topics/ccd-case-events-aat"
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6442,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->